In [2]:
import pandas as pd
from pandas_datareader import data as pdr
import yfinance as yf
yf.pdr_override()

In [3]:
df = pdr.get_data_yahoo(['ABEV3.SA','MGLU3.SA','WEGE3.SA','VALE3.SA'], start = '2017-10-02')['Adj Close']
df

[*********************100%***********************]  4 of 4 completed

             ABEV3.SA  MGLU3.SA   VALE3.SA   WEGE3.SA
Date
2017-10-02  17.058567  2.334204  22.000366   7.606671
2017-10-03  17.651907  2.367473  22.538305   7.903500
2017-10-04  17.470612  2.382759  22.490028   7.939263
2017-10-05  17.495331  2.349789  22.255543   7.971447
2017-10-06  17.363474  2.388753  22.165888   7.935686
...               ...       ...        ...        ...
2023-01-10  14.540000  3.050000  93.580002  37.549999
2023-01-11  14.290000  3.030000  93.250000  38.599998
2023-01-12  14.100000  3.190000  93.739998  38.509998
2023-01-13  13.880000  3.430000  93.820000  38.970001
2023-01-16  13.470000  3.790000  91.809998  37.580002

[1315 rows x 4 columns]

In [4]:
media_retornos_diarios = df.pct_change().dropna().mean()

media_retornos_diarios

ABEV3.SA    0.000005
MGLU3.SA    0.001135
VALE3.SA    0.001414
WEGE3.SA    0.001503
dtype: float64

In [5]:
# Usando map para transformar dados

dados_anuais = media_retornos_diarios.map(lambda x: (1 + x) ** 252 -1)
dados_anuais

ABEV3.SA    0.001287
MGLU3.SA    0.331009
VALE3.SA    0.427734
WEGE3.SA    0.460182
dtype: float64

In [6]:
dados_anuais = dados_anuais.to_frame()
dados_anuais

                 0
ABEV3.SA  0.001287
MGLU3.SA  0.331009
VALE3.SA  0.427734
WEGE3.SA  0.460182

In [7]:
dados_anuais = dados_anuais.reset_index()

dados_anuais.columns = ['nome_empresas', 'retornos_anuais']

dados_anuais

  nome_empresas  retornos_anuais
0      ABEV3.SA         0.001287
1      MGLU3.SA         0.331009
2      VALE3.SA         0.427734
3      WEGE3.SA         0.460182

In [8]:
dados_anuais['nome_empresas'] = dados_anuais['nome_empresas'].map(lambda x: x.lower())

dados_anuais

#sempre que vocÃª precisar aplicar uma funÃ§Ã£o a uma coluna, utilize o map

  nome_empresas  retornos_anuais
0      abev3.sa         0.001287
1      mglu3.sa         0.331009
2      vale3.sa         0.427734
3      wege3.sa         0.460182

# ExercÃ­cios

Use o DataFrame base do notebook 'Lidando com valores duplicados' para:
- ExercÃ­cio 70: Transforme todos os nomes das empresas em letras minÃºsculas.
- ExercÃ­cio 71: Transforma a coluna de cotaÃ§Ãµes para reais. Ex: 20 -> R$20

In [17]:
#df_base
dados_cotacoes = {
    'tickers': ["WEGE3", "PETR3", "VALE3", "PETR4","LREN3"],
    'cotacoes': [20, 30, 40, 12, 35],
    'nomes': ["Weg", "Petrobras", "Vale", "Petrobras", "Lojas Renner"],
    'preco_sobre_lucro': [25,6,12,7,25],
    'volume': [5000, 1000, 4000,7000,1200]
}

df = pd.DataFrame(dados_cotacoes, index = [0,1,2,3,4],
                 columns = ['nomes','tickers','cotacoes','preco_sobre_lucro','volume'])

df = df.set_index('tickers')
df.columns = ['nomes', 'precos', 'preco_sobre_lucro', 'volume']

df['lucro_por_acao'] = df['precos']/df['preco_sobre_lucro']

cotacao_dolar = 5.25
df['cotacao_dolarizada'] = df['precos'] / cotacao_dolar

df

,nomes,precos,preco_sobre_lucro,volume,lucro_por_acao,cotacao_dolarizada
tickers,,,,,,
WEGE3,Weg,20,25,5000,0.800000,3.809524
PETR3,Petrobras,30,6,1000,5.000000,5.714286
VALE3,Vale,40,12,4000,3.333333,7.619048
PETR4,Petrobras,12,7,7000,1.714286,2.285714
LREN3,Lojas Renner,35,25,1200,1.400000,6.666667

In [18]:
# ExercÃ­cio 70
df['nomes'] = df['nomes'].map(lambda x: x.lower())
df

,nomes,precos,preco_sobre_lucro,volume,lucro_por_acao,cotacao_dolarizada
tickers,,,,,,
WEGE3,weg,20,25,5000,0.800000,3.809524
PETR3,petrobras,30,6,1000,5.000000,5.714286
VALE3,vale,40,12,4000,3.333333,7.619048
PETR4,petrobras,12,7,7000,1.714286,2.285714
LREN3,lojas renner,35,25,1200,1.400000,6.666667

In [19]:
df['precos'] = df['precos'].map(lambda x: 'R$' + str(x))
df

,nomes,precos,preco_sobre_lucro,volume,lucro_por_acao,cotacao_dolarizada
tickers,,,,,,
WEGE3,weg,R$20,25,5000,0.800000,3.809524
PETR3,petrobras,R$30,6,1000,5.000000,5.714286
VALE3,vale,R$40,12,4000,3.333333,7.619048
PETR4,petrobras,R$12,7,7000,1.714286,2.285714
LREN3,lojas renner,R$35,25,1200,1.400000,6.666667